# 피벗테이블로 데이터 집계하기
* 피벗테이블은 표의 데이터를 요약하는 통계표이다.
* pd.**pivot_table**(데이터프레임, index=인덱스, columns=컬럼, values=집계할데이터, aggfunc=통계함수)
* aggrunc의 디폴트는 mean

In [ ]:
import pandas as pd

In [ ]:
# 샘플데이터
df = pd.DataFrame({"item": ["shirts", "shirts", "shirts", "shirts", "shirts",
                          "pants", "pants", "pants", "pants"],
                    "color": ["white", "white", "white", "black", "black",
                          "white", "white", "black", "black"],
                   "size": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                         "large"],
                   "sale": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "inventory": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

In [ ]:
df

In [ ]:
# item, size별 재고 합계

In [ ]:
# [item,color], size별 재고 합계

In [ ]:
# null값은 0으로 처리

In [ ]:
# [item,color], size별 판매,재고 합계

# 타이타닉호 성별, 객실등급별 생존분석

In [3]:
import pandas as pd
df = pd.read_csv('C:/Users/user/Documents/python/Pandas/titanic.csv')
#df_titanic = df[['Survived','Pclass','Sex','Age','Embarked']]
#df_titanic = df_titanic.dropna()
#df_titanic.head()

display(df)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
df_titanic = df[['Survived','Pclass','Sex','Age','Embarked']]
df_titanic = df_titanic.dropna()
df_titanic.head()

   Survived  Pclass     Sex   Age Embarked
0         0       3    male  22.0        S
1         1       1  female  38.0        C
2         1       3  female  26.0        S
3         1       1  female  35.0        S
4         0       3    male  35.0        S

In [13]:
print(len(df))
len(df_titanic)

891

712

## 성별,객실등급별 승선자 수
* count

In [21]:
gender_count = df_titanic.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='count')
display(gender_count)

Pclass    1   2    3
Sex
female   83  74  102
male    101  99  253

## 성별,객실등급별 생존자 수 
* sum

In [23]:
gender_survive = df_titanic.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='sum')
display(gender_survive)

Pclass   1   2   3
Sex
female  80  68  47
male    40  15  38

In [31]:
df1 = df.groupby('Pclass').Survived.count().to_frame()
display(df1)

        Survived
Pclass
1            216
2            184
3            491

In [33]:
df2 = df.groupby('Pclass').Survived.sum().to_frame()
display(df2)

        Survived
Pclass
1            136
2             87
3            119

In [35]:
df3 = df.groupby('Pclass').Survived.mean().to_frame()
display(df3)

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

In [37]:
df4 = pd.concat([df1, df2, df3], axis=1)
df4.columns = ['승선자 수', '생존자 수', '생존율']

display(df4)

        승선자 수  생존자 수       생존율
Pclass
1         216    136  0.629630
2         184     87  0.472826
3         491    119  0.242363

## 성별, 객실등급별 생존율
* mean(default)

In [39]:
df5 = df.groupby('Sex').Survived.count().to_frame()
display(df5)

        Survived
Sex
female       314
male         577

In [41]:
df6 = df.groupby('Sex').Survived.sum().to_frame()
display(df6)

        Survived
Sex
female       233
male         109

In [43]:
df7 = df.groupby('Sex').Survived.mean().to_frame()
display(df7)

        Survived
Sex
female  0.742038
male    0.188908

In [47]:
df8 = pd.concat([df5, df6, df7], axis=1)
df8.columns = ['승선자 수', '생존자 수', '생존율']

display(df8)

        승선자 수  생존자 수       생존율
Sex
female    314    233  0.742038
male      577    109  0.188908